<a href="https://colab.research.google.com/github/tallywiesenberg/CheatSheets/blob/master/Wiesenberg_DS_Unit_1_Sprint_Challenge_2_Data_Wrangling_and_Storytelling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Science Unit 1 Sprint Challenge 2

## Data Wrangling and Storytelling

Taming data from its raw form into informative insights and stories.

## Data Wrangling

In this Sprint Challenge you will first "wrangle" some data from [Gapminder](https://www.gapminder.org/about-gapminder/), a Swedish non-profit co-founded by Hans Rosling. "Gapminder produces free teaching resources making the world understandable based on reliable statistics."
- [Cell phones (total), by country and year](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--cell_phones_total--by--geo--time.csv)
- [Population (total), by country and year](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv)
- [Geo country codes](https://github.com/open-numbers/ddf--gapminder--systema_globalis/blob/master/ddf--entities--geo--country.csv)

These two links have everything you need to successfully complete the first part of this sprint challenge.
- [Pandas documentation: Working with Text Data](https://pandas.pydata.org/pandas-docs/stable/text.html) (one question)
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf) (everything else)

### Part 0. Load data

You don't need to add or change anything here. Just run this cell and it loads the data for you, into three dataframes.

In [0]:
import pandas as pd

cell_phones = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--cell_phones_total--by--geo--time.csv')

population = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv')

geo_country_codes = (pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--entities--geo--country.csv')
                       .rename(columns={'country': 'geo', 'name': 'country'}))

In [132]:
print(cell_phones.shape)
cell_phones.head()

(9215, 3)

   geo  time  cell_phones_total
0  abw  1960                0.0
1  abw  1965                0.0
2  abw  1970                0.0
3  abw  1975                0.0
4  abw  1976                0.0

In [133]:
print(population.shape)
population.head()

(59297, 3)

   geo  time  population_total
0  afg  1800           3280000
1  afg  1801           3280000
2  afg  1802           3280000
3  afg  1803           3280000
4  afg  1804           3280000

In [134]:
print(geo_country_codes.shape)
geo_country_codes.head()

(273, 33)

    geo alt_5  ... world_4region        world_6region
0  abkh   NaN  ...        europe  europe_central_asia
1   abw   NaN  ...      americas              america
2   afg   NaN  ...          asia           south_asia
3   ago   NaN  ...        africa   sub_saharan_africa
4   aia   NaN  ...      americas              america

[5 rows x 33 columns]

### Part 1. Join data

First, join the `cell_phones` and `population` dataframes (with an inner join on `geo` and `time`).

The resulting dataframe's shape should be: (8590, 4)

In [135]:
#intermediate dataframe
df_temp = pd.merge(population, cell_phones, on=['geo', 'time'])
print(df_temp.shape)
df_temp.head()

(8590, 4)

   geo  time  population_total  cell_phones_total
0  afg  1960           8996351                0.0
1  afg  1965           9938414                0.0
2  afg  1970          11126123                0.0
3  afg  1975          12590286                0.0
4  afg  1976          12840299                0.0

Then, select the `geo` and `country` columns from the `geo_country_codes` dataframe, and join with your population and cell phone data.

The resulting dataframe's shape should be: (8590, 5)

In [136]:
df = pd.merge(df_temp, geo_country_codes[['geo', 'country']])
print(df.shape)
df.head()

(8590, 5)

   geo  time  population_total  cell_phones_total      country
0  afg  1960           8996351                0.0  Afghanistan
1  afg  1965           9938414                0.0  Afghanistan
2  afg  1970          11126123                0.0  Afghanistan
3  afg  1975          12590286                0.0  Afghanistan
4  afg  1976          12840299                0.0  Afghanistan

### Part 2. Make features

Calculate the number of cell phones per person, and add this column onto your dataframe.

(You've calculated correctly if you get 1.220 cell phones per person in the United States in 2017.)

In [137]:
df['cell_phones_per_capita'] = df['cell_phones_total']/df['population_total']
df.loc[df['country'] == 'United States'].loc[df['time'] == 2017]

      geo  time  ...        country  cell_phones_per_capita
8134  usa  2017  ...  United States      1.2201246847283354

[1 rows x 6 columns]

Modify the `geo` column to make the geo codes uppercase instead of lowercase.

In [138]:
df['geo'] = df['geo'].str.upper()
df['geo'].head()

0    AFG
1    AFG
2    AFG
3    AFG
4    AFG
Name: geo, dtype: object

### Part 3. Process data

Use the describe function, to describe your dataframe's numeric columns, and then its non-numeric columns.

(You'll see the time period ranges from 1960 to 2017, and there are 195 unique countries represented.)

In [139]:
#numeric
df.describe()

                     time  ...  cell_phones_per_capita
count             8,590.0  ...                 8,590.0
mean  1,994.1934807916182  ...      0.2796385558059151
std    14.257974607310302  ...       0.454246656214052
min               1,960.0  ...                     0.0
25%               1,983.0  ...                     0.0
50%               1,995.0  ...   0.0015636266438163813
75%               2,006.0  ...      0.4611491855201403
max               2,017.0  ...       2.490242818521353

[8 rows x 4 columns]

In [140]:
#non-numeric
df.describe(include='object')

         geo         country
count   8590            8590
unique   195             195
top      AND  United Kingdom
freq      46              46

In 2017, what were the top 5 countries with the most cell phones total?

Your list of countries should have these totals:

| country | cell phones total |
|:-------:|:-----------------:|
|    ?    |     1,474,097,000 |
|    ?    |     1,168,902,277 |
|    ?    |       458,923,202 |
|    ?    |       395,881,000 |
|    ?    |       236,488,548 |

In [0]:
# This optional code formats float numbers with comma separators
pd.options.display.float_format = '{:,}'.format

In [142]:
#top 5 countries 
df[['country', 'cell_phones_total']].nlargest(5, 'cell_phones_total')

     country  cell_phones_total
1496   China    1,474,097,000.0
1495   China    1,364,934,000.0
1494   China    1,291,984,200.0
1493   China    1,286,093,000.0
1492   China    1,229,113,000.0

2017 was the first year that China had more cell phones than people.

What was the first year that the USA had more cell phones than people?

In [143]:
df[['time', 'country', 'cell_phones_total', 'population_total']].loc[df['country'] == 'United States'].loc[df['population_total'] < df['cell_phones_total']]
#2014 was the first year where USA had more cell phones than people

      time        country  cell_phones_total  population_total
8131  2014  United States      355,500,000.0         317718779
8132  2015  United States      382,307,000.0         319929162
8133  2016  United States      395,881,000.0         322179605
8134  2017  United States      395,881,000.0         324459463

### Part 4. Reshape data

*This part is not needed to pass the sprint challenge, only to get a 3! Only work on this after completing the other sections.*

Create a pivot table:
- Columns: Years 2007—2017
- Rows: China, India, United States, Indonesia, Brazil (order doesn't matter)
- Values: Cell Phones Total

The table's shape should be: (5, 11)

In [197]:
pivot = pd.pivot_table(df, values='cell_phones_total', index=df['country'], columns=df['time'])
pivot.head()

time         1960  1965  1970  ...         2015         2016         2017
country                        ...
Afghanistan   0.0   0.0   0.0  ... 19,709,038.0 21,602,982.0 23,929,713.0
Albania       0.0   0.0   0.0  ...  3,400,955.0  3,369,756.0  3,497,950.0
Algeria       0.0   0.0   0.0  ... 43,227,643.0 47,041,321.0 49,873,389.0
Andorra       0.0   0.0   0.0  ...     71,336.0     76,132.0     80,337.0
Angola        0.0   0.0   0.0  ... 13,884,532.0 13,001,124.0 13,323,952.0

[5 rows x 46 columns]

In [198]:
pivot = pivot.loc[['China', 'India', 'United States', 'Indonesia', 'Brazil']]
pivot = pivot.loc[:,range(2007,2018)]
pivot.head()

time                   2007          2008  ...            2016            2017
country                                    ...
China         547,306,000.0 641,245,000.0  ... 1,364,934,000.0 1,474,097,000.0
India         233,620,000.0 346,890,000.0  ... 1,127,809,000.0 1,168,902,277.0
United States 249,300,000.0 261,300,000.0  ...   395,881,000.0   395,881,000.0
Indonesia      93,386,881.0 140,578,243.0  ...   385,573,398.0   458,923,202.0
Brazil        120,980,103.0 150,641,403.0  ...   244,067,356.0   236,488,548.0

[5 rows x 11 columns]

Sort these 5 countries, by biggest increase in cell phones from 2007 to 2017.

Which country had 935,282,277 more cell phones in 2017 versus 2007?

In [204]:
pivot['increase'] = pivot.loc[:, 2017] - pivot.loc[:, 2007]
pivot['increase'].nlargest(5)

country
India           935,282,277.0
China           926,791,000.0
Indonesia       365,536,321.0
United States   146,581,000.0
Brazil          115,508,445.0
Name: increase, dtype: float64

In [212]:
largest_increase_country = pivot['change'].nlargest(1)
print('The largest increase in cell phones for the selected countries between 2007 and 2017 was', largest_increase_country)

The largest increase in cell phones for the selected countries between 2007 and 2017 was country
India   935,282,277.0
Name: change, dtype: float64

If you have the time and curiosity, what other questions can you ask and answer with this data?

## Data Storytelling

In this part of the sprint challenge you'll work with a dataset from **FiveThirtyEight's article, [Every Guest Jon Stewart Ever Had On ‘The Daily Show’](https://fivethirtyeight.com/features/every-guest-jon-stewart-ever-had-on-the-daily-show/)**!

### Part 0 — Run this starter code

You don't need to add or change anything here. Just run this cell and it loads the data for you, into a dataframe named `df`.

(You can explore the data if you want, but it's not required to pass the Sprint Challenge.)

In [0]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

url = 'https://raw.githubusercontent.com/fivethirtyeight/data/master/daily-show-guests/daily_show_guests.csv'
df = pd.read_csv(url).rename(columns={'YEAR': 'Year', 'Raw_Guest_List': 'Guest'})

def get_occupation(group):
    if group in ['Acting', 'Comedy', 'Musician']:
        return 'Acting, Comedy & Music'
    elif group in ['Media', 'media']:
        return 'Media'
    elif group in ['Government', 'Politician', 'Political Aide']:
        return 'Government and Politics'
    else:
        return 'Other'
      
df['Occupation'] = df['Group'].apply(get_occupation)

### Part 1 — What's the breakdown of guests’ occupations per year?

For example, in 1999, what percentage of guests were actors, comedians, or musicians? What percentage were in the media? What percentage were in politics? What percentage were from another occupation?

Then, what about in 2000? In 2001? And so on, up through 2015.

So, **for each year of _The Daily Show_, calculate the percentage of guests from each occupation:**
- Acting, Comedy & Music
- Government and Politics
- Media
- Other

#### Hints:
You can make a crosstab. (See pandas documentation for examples, explanation, and parameters.)

You'll know you've calculated correctly when the percentage of "Acting, Comedy & Music" guests is 90.36% in 1999, and 45% in 2015.

In [0]:
df.head()

In [0]:
df.groupby('Year')['Occupation'].value_counts(normalize=True).round(3).unstack(0)

### Part 2 — Recreate this explanatory visualization:

In [0]:
from IPython.display import display, Image
png = 'https://fivethirtyeight.com/wp-content/uploads/2015/08/hickey-datalab-dailyshow.png'
example = Image(png, width=500)
display(example)

**Hints:**
- You can choose any Python visualization library you want. I've verified the plot can be reproduced with matplotlib, pandas plot, or seaborn. I assume other libraries like altair or plotly would work too.
- If you choose to use seaborn, you may want to upgrade the version to 0.9.0.

**Expectations:** Your plot should include:
- 3 lines visualizing "occupation of guests, by year." The shapes of the lines should look roughly identical to 538's example. Each line should be a different color. (But you don't need to use the _same_ colors as 538.)
- Legend or labels for the lines. (But you don't need each label positioned next to its line or colored like 538.)
- Title in the upper left: _"Who Got To Be On 'The Daily Show'?"_ with more visual emphasis than the subtitle. (Bolder and/or larger font.)
- Subtitle underneath the title: _"Occupation of guests, by year"_

**Optional Bonus Challenge:**
- Give your plot polished aesthetics, with improved resemblance to the 538 example.
- Any visual element not specifically mentioned in the expectations is an optional bonus.

In [0]:
from matplotlib.ticker import FuncFormatter
plt.style.use('fivethirtyeight')
df_temp = df[df['Occupation'] != 'Other']
fig = df_temp.groupby('Year')['Occupation'].value_counts(normalize=True).unstack(1).plot(figsize=(8, 5))
fig.yaxis.set_major_formatter(FuncFormatter(lambda y, _: '{:.0%}'.format(y))) #create readable percent axis
#title
plt.text(x=1998, y=1.05, s="Who Got to Be On 'The Daily Show'?",
         fontsize=16, fontweight='bold')
plt.text(x=1998, y=1, s="Occupation of guests, by year",
         fontsize=14)